import React, { useRef } from "react";
import "bootstrap/dist/css/bootstrap.min.css";
import './App.css';
import { Container, Button, Table } from "react-bootstrap";
import { BrowserRouter,NavLink,Route, Routes } from "react-router-dom";
import Contact from "./Contact";

export function Layout() {
  return (
    <nav className="bg-secondary p-2 mb-3 text-center">
      <NavLink
        to="/"
        className="link px-2"
        style={({ isActive }) => {
          return {
            textDecoration: isActive ? "none" : "underline",
          };
        }}
      >
        หน้าแรก
      </NavLink>
      <NavLink
        to="/product"
        className="link px-2"
        style={({ isActive }) => {
          return {
            textDecoration: isActive ? "none" : "underline",
          };
        }}
      >
        ตารางเทียบแคลอรี
      </NavLink>
      <NavLink
        to="/contact"
        className="link px-2"
        style={({ isActive }) => {
          return {
            textDecoration: isActive ? "none" : "underline",
          };
        }}
      >
        ผู้จัดทำ
      </NavLink>
    </nav>
  );
}

function Index() {
  return (
    <>
      <Layout />
      <h2>อาหารพื้นเมืองที่มีสรรพคุณต่อสุขภาพตามวิถีภูมิปัญญาท้องถิ่นของจังหวัดอุบลราชธานี</h2>
      <br>

      </br>
      <img src="f0702.jpg" alt="menu1"></img>
      <h1 >อู๋หน่อไม้พุงปลา</h1>
      <p>อู๋หน่อไม้พุงปลา
     อุ๋หน่อไม้พุงปลา เป็นอาหารพื้นเมืองที่มีสรรพคุณต่อสุขภาพ ตามวิถีภูมิปัญญาท้องถิ่น ของจังหวัดอุบลราชธานี ที่ได้สืบทอดกันมารุ่นต่อรุ่น มีความโดดเด่นและมีความเป็นเอกลักษณ์ของจังหวัดอุบลราชธานี อุ๋เป็นอาหารพื้นเมืองที่มีลักษณะคล้ายแกงอ่อม แต่วิธีการทำจะใส่น้ำในปริมาณที่น้อยกว่า ส่วนใหญ่นิยมทำกับพุงปลา โดยใช้พุงปลา ซึ่งเป็นปลาธรรมชาติจากลุ่มแม่น้ำโขง เนื้อปลามีคุณค่าทางโภชนาการ อุดมไปด้วยโปรตีนสูง ไขมันต่ำ และจำเป็นต่อร่างกาย โดยการนำพุงปลาและหน่อไม้ลงไปต้มจนสุกปรุงด้วยเครื่องปรุงรสด้วยเกลือ น้ำปลา น้ำปลาร้า เติมความเผ็ดด้วยพริกสด แล้วโรยด้วยใบโหระพาเพื่อเป็นการเพิ่มกลิ่นหอม พุงปลาเมื่อโดนความร้อนจะกระจายไขมันออกมา บวกกับรสขมนิดๆ จากดีปลาที่ติดอยู่ในพุงปลา จะได้รสชาติกลมกล่อม เป็นความผสมผสานที่ลงตัวระหว่างชนิดของอาหาร และเครื่องปรุง มีรสชาติกลมกล่อม มีเสน่ห์ของความเป็นไทย เป็นต้นตำรับเมนูสมุนไพรโบราณที่มีมาช้านานมีคุณค่าทางสมุนไพรสูงจากหน่อไม้ เป็นอาหารที่ผูกพันกับวิถีชีวิตของคนไทยมาช้านาน มีคุณค่าทางโภชนาการและสรรพคุณทางยา มีสารต่อต้านอนุมูลอิสระช่วยเสริมสร้างภูมิต้านโรคในร่างกายให้แข็งแรง หน่อไม้มีเส้นใยสูง ป้องกันอาการท้องผูก ช่วยระบบขับถ่ายได้เป็นอย่างดี ช่วยลดการเกิดมะเร็งลำไส้ใหญ่ ล้วนมีสรรพคุณต่อสุขภาพร่างกายแทบทั้งสิ้น
     จึงถือได้ว่า อุ๋หน่อไม้พุงปลา เป็นอาหารพื้นเมือง ที่มีสรรพคุณต่อสุขภาพ ของจังหวัดอุบลราชธานี มีความโดดเด่นและมีเอกลักษณ์ ของความเป็นไทย เป็นอาหารแห่งความมีคุณค่าทางโภชนาการ และสรรพคุณทางยาจากพืชผักสมุนไพรพื้นบ้านที่มีประโยชน์นานาชนิด ที่ช่วยเสริมภูมิต้านทานและป้องกันโรค เป็นวัฒนธรรมอาหารที่ควรอนุรักษ์ และยังแสดงออกถึงภูมิปัญญาท้องถิ่น ถือเป็นภูมิปัญญาไทยและมรดกทางวัฒนธรรมอาหารพื้นเมืองที่ต้องรักษาสืบทอดกันต่อไป
</p>
      <button type="button">เรียนรู้เพิ่มเติม>></button>
      <br>
      </br>
      <br>
      </br>
      
    <>
      <img src="f0802.jpg" alt="menu1"></img>
      <h1>ลาบปลาคัง</h1>
      <p> ลาบปลาคัง เป็นอาหารพื้นเมืองที่มีสรรพคุณต่อสุขภาพ ตามวิถีภูมิปัญญาท้องถิ่น ของจังหวัดอุบลราชธานี ที่ได้สืบทอดกันมารุ่นต่อรุ่น มีความโดดเด่นและมีความเป็นเอกลักษณ์ของจังหวัดอุบลราชธานี เป็นต้นตำรับเมนูสมุนไพรโบราณที่มีมาช้านานทั้งในเรื่องของรสชาติที่กลมกล่อม เครื่องปรุงล้วนเป็นสมุนไพรจากธรรมชาติ มีคุณค่าทางสมุนไพรสูง เป็นอาหารพื้นเมืองที่มีส่วนประกอบหลัก คือ เนื้อปลาคัง ซึ่งเป็นปลาธรรมชาติจากลุ่มแม่น้ำโขง เนื้อปลามีคุณค่าทางโภชนาการ อุดมไปด้วยโปรตีนสูง ไขมันต่ำ และจำเป็นต่อร่างกาย ป้องกันการอุดตันในเส้นเลือด โรคหัวใจ และเส้นเลือดในสมองแตก ช่วยบำรุงเซลล์สมองและเสริมสร้างผนังเซลล์ประสาทในสมองให้แข็งแรง ประกอบกับจังหวัดอุบลราชธานีมีแม่น้ำไหลผ่านถึง 3 สาย ได้แก่ แม่น้ำมูล แม่น้ำชี และแม่น้ำโขง จึงอุดมไปด้วยพันธุ์ปลานานาชนิด จึงได้รับสมญานามยกให้เป็นราชธานีแห่งปลาแซ่บหลาย ดังนั้นลาบปลาคัง จึงเป็นอาหารพื้นเมือง ที่มีเอกลักษณ์เฉพาะ คือ เนื้อปลาคังจะเหนียวแน่น หวานอร่อย มีรสชาติที่ไม่เหมือน ลาบปลาชนิดอื่น เมื่อนำเนื้อปลาคังมาต้ม นำมาสับให้ละเอียด หรือ หั่นเป็นชิ้นเล็กๆบางๆ ปรุงด้วยเครื่องปรุงรสด้วยเกลือ น้ำปลา น้ำปลาร้า มะนาว แล้วโรยด้วยข้าวคั่ว เติมความเผ็ดด้วยพริกป่น กลิ่นหอมจากข้าวคั่วและใบสะระแหน่ ใบมะกรูดซอย ต้นหอม และหอมแดง เป็นความผสมผสานที่ลงตัวระหว่างชนิดของอาหาร และเครื่องปรุง มีรสชาติ เผ็ดกลมกล่อม มีเสน่ห์ของความเป็นไทย รับประทานกับข้าวเหนียวและเครื่องเคียงผักพื้นบ้านนานาชนิด อาทิ แตงกวา ยอดกระถิน ลิ้นฟ้า ยอดมะกอก ยอดมะเฟือง ยอดมะตูม ยอดสะเดา เป็นต้น ซึ่งมีคุณค่าทางสมุนไพรสูง มีใยอาหารสูง มีวิตามิน และเกลือแร่ที่สำคัญ อยู่ในส่วนประกอบของอาหารและในส่วนที่เป็นเครื่องเคียง อุดมด้วยพืชผักสมุนไพรมากมายหลายชนิด ซึ่งมีสรรพคุณทางยาจากสารพฤกษเคมี ช่วยต้านอนุมูลอิสระ ส่งเสริมระบบภูมิคุ้มกันและลดอัตราเสี่ยงต่อการเกิดโรค เช่น โรคไขมันในเลือดสูง โรคหัวใจและหลอดเลือด โรคความดันโลหิตสูง โรคเบาหวาน เป็นต้น
     จึงถือได้ว่า ลาบปลาคัง เป็นอาหารพื้นเมือง ที่มีสรรพคุณต่อสุขภาพ ของจังหวัดอุบลราชธานี มีความโดดเด่นและมีเอกลักษณ์ ของความเป็นไทย ถูกปรุงแต่งและถ่ายทอดสูตรอาหารพื้นเมืองโบราณของจังหวัดอุบลราชธานีมาช้านาน เป็นอาหารแห่งความมีคุณค่าทางโภชนาการ และสรรพคุณทางยาจากพืชผักสมุนไพรพื้นบ้านที่มีประโยชน์นานาชนิด เป็นวัฒนธรรมอาหารที่ควรอนุรักษ์ และยังแสดงออกถึงภูมิปัญญาท้องถิ่น ถือเป็นภูมิปัญญาไทยและมรดกทางวัฒนธรรมอาหารพื้นเมืองที่ต้องรักษาสืบทอดกันต่อไป
</p>
      <button type="button">เรียนรู้เพิ่มเติม>></button>
      <br>
      </br>
      <br>
      </br>
    </>
        <img src="f0902.jpg" alt="menu1"></img>
      <h1>แกงอ่อมหอยขม</h1>
      <p>แกงอ่อมหอยขม เป็นอาหารพื้นเมืองที่มีสรรพคุณต่อสุขภาพ ตามวิถีภูมิปัญญาท้องถิ่น ของจังหวัดอุบลราชธานี ที่ได้สืบทอดกันมารุ่นต่อรุ่น เป็นแกงอ่อมอาหารพื้นเมืองที่อุดมไปด้วยคุณค่าทางโภชนาการเพราะส่วนประกอบหลักส่วนใหญ่เป็นผักและสมุนไพรพื้นบ้านนานาชนิดเป็นความผสมผสานที่ลงตัวระหว่างชนิดของอาหาร และเครื่องปรุง มีเสน่ห์ของความเป็นไทย ต้นตำรับเมนูสมุนไพรโบราณที่มีมาช้านานของจังหวัดอุบลราชธานี โดยการนำหอยขมหรือหอยจุ๊บที่อยู่ในแหล่งน้ำตามธรรมชาติ มีคุณค่าทางโภชนาการเป็นแหล่งโปรตีน และคอลาเจน ที่มีประโยชน์ต่อร่างกาย มาแกงผสมผสานเข้ากับน้ำคั้นใบย่านางสีเขียวเข้มที่มีสารต่อต้านอนุมูลอิสระ และมีสรรพคุณ เสริมสร้างภูมิต้านทานโรคในร่างกาย ช่วยขับพิษและลดไข้ ช่วยป้องกันการเกิดโรคหัวใจ ช่วยลดระดับน้ำตาลในเลือด และลดความดันโลหิตสูงได้ ยังมีข้าวเบือ คือ การนำข้าวเหนียวมาแช่น้ำไว้อย่างน้อย 1 ชั่วโมงให้เมล็ดข้าวเหนียวอ่อนนุ่ม สงให้สะเด็ดน้ำ แล้วนำมาโขลกให้ละเอียด ไว้ใส่ในแกงอ่อม ที่ช่วยให้ส่วนผสมน้ำแกงรสเผ็ดร้อนเข้มข้นกลมกล่อม ปรุงรสนัวด้วยน้ำปลาร้า เติมความเผ็ดด้วยพริกสด กลิ่นหอมจากสมุนไพรสดในเครื่องพริกแกงอ่อม ได้แก่ ใบแมงลัก ข่า ตะไคร้ หัวหอม กระเทียม ต้นหอม รวมไปถึงกลิ่นหอมของผักชีลาว ซึ่งเป็นเอกลักษณ์ของแกงอ่อมอีสานรวมอยู่ด้วย ล้วนมีสรรพคุณทางยา มีสารต่อต้านอนุมูลอิสระ ช่วยลดความดันโลหิต ลดไขมันในเลือดได้ดี และยังมีส่วนช่วยกระตุ้นระบบการขับถ่ายให้ทำงานอย่างเป็นปกติอีกด้วย และที่ขาดไม่ได้คือ ใบชะพลู นั้นถือได้ว่าเป็นพืชผักพื้นบ้านที่อยู่คู่ครัวและภูมิปัญญาไทย มายาวนาน มีสรรพคุณทางยาที่สำคัญ ช่วยบำรุงธาตุ ขับลม แก้อาการท้องอืดท้องเฟ้อ และช่วยในการขับเสมหะ และช่วยลดระดับน้ำตาลในเลือด เป็นต้น นอกจากนี้ในใบชะพลูยังมีวิตามินเอช่วยบำรุงและรักษาสายตา และมีแคลเซียม ธาตุเหล็ก ธาตุฟอสฟอรัส คลอโรฟิลล์ เส้นใย ซึ่งล้วนแล้วแต่มีประโยชน์ของสมุนไพรที่มีสรรพคุณต่อสุขภาพร่างกายแทบทั้งสิ้น
     จึงถือได้ว่า แกงอ่อมหอยขม เป็นอาหารพื้นเมือง ที่มีสรรพคุณต่อสุขภาพ ของจังหวัดอุบลราชธานี มีความโดดเด่นและมีเอกลักษณ์ ของความเป็นไทย ถูกปรุงแต่งและถ่ายทอดสูตรอาหารพื้นเมืองโบราณของจังหวัดอุบลราชธานีมาช้านาน เป็นอาหารแห่งความมีคุณค่าทางโภชนาการ และสรรพคุณทางยาจากพืชผักสมุนไพรพื้นบ้านที่มีประโยชน์นานาชนิด เป็นวัฒนธรรมอาหารที่ควรอนุรักษ์ และยังแสดงออกถึงภูมิปัญญาท้องถิ่น ถือเป็นภูมิปัญญาไทยและมรดกทางวัฒนธรรมอาหารพื้นเมืองที่ต้องรักษาสืบทอดกันต่อไป
</p>
<button type="button">เรียนรู้เพิ่มเติม>></button>
      <br>
      </br>
      <br>
      </br>
    </>
  );
}

function Product() {
  const table = useRef();
  const tr = useRef([]);
  const DeleteRow = (i) => {
    const index = tr.current[i].rowIndex;
    table.current.deleteRow(index);
  }

  const data = [
    ["อู๋หน่อไม้พุงปลา",1200],
    ["ลาบปลาคัง",1500],
    ["แกงอ่อมหอยขม",1150],
  ];




  return (
    <>
      <Layout />
      <Table striped bordered hover className="my-3"ref={table}>
        <thead>
          <tr>
            <th>เมนูอาหาร</th>
            <th>พลังงานที่ได้รับ</th>
            <th>เลือกเมนูนี้</th>
          </tr>
        </thead>
        <tbody>
          {data.map((item,i) => {
            return (
              <tr 
                ref={(el) => {
                  tr.current[i] = el;
                }} 
                key={i}
              >
                <td>{item[0]}</td>
                <td>{item[1]}</td>
                <td><Button variant="danger" onClick={()=>DeleteRow(i)}>เลือกเมนูนี้</Button></td>
              </tr>
            );
          })}
        </tbody>
      </Table>
    </>
  );
}

          

function App() {
  return (
    <BrowserRouter>
      <Container className="p-3 my-3 bg-light">
        <Routes>
          <Route path="/" element={<Index />} />
          <Route path="/main" element={<Index />} />
          <Route path="/product" element={<Product />} />
          <Route path="/contact" element={<Contact />} />
        </Routes>
      </Container>
    </BrowserRouter>
  );
}
export default App;